import JAVA_HW_Module_01_Ua.Task1;
import JAVA_HW_Module_01_Ua.Task2;
import JAVA_HW_Module_01_Ua.Task3;
import JAVA_HW_Module_01_Ua.Task4;
import JAVA_HW_Module_01_Ua.Task5;
import JAVA_HW_Module_01_Ua.Task6;
import JAVA_HW_Module_01_Ua.Task7;
import JAVA_HW_Module_01_Ua.Task9;
import JAVA_HW_Module_01_Ua.Task11;
import JAVA_HW_Module_01_Ua.Task12;

public class Main
{
    public static void main(String[] args)
    {
//        System.out.println("Вивести на екран надпис \"Your time is limited, so don’t waste it living someone else’s life\" Steve Jobs в різних рядках.");
//        Task1.run();
//        System.out.println();
//
//        System.out.println("Користувач вводить з клавіатури два числа. Перше число — це значення, друге число — відсоток, який необхідно підрахувати. Наприклад, ми ввели з клавіатури 50 і 10. Потрібно вивести на екран 10 відсотків від 50. Результат — 5.");
//        Task2.run();
//        System.out.println();
//
//        System.out.println("Користувач вводить з клавіатури 3 числа. Необхідно створити число, що містить ці числа. Наприклад, якщо з клавіатури введено 7, 3, 8, тоді потрібно сформувати число 738.");
//        Task3.run();
//        System.out.println();
//
//        System.out.println("Користувач вводить шестизначне число. Необхідно змінити в цьому числі перше і шосте число, а також друге і п’яте число. Наприклад, 723895 повинно перетворитися на 593827\n" +
//                "Якщо користувач ввів не шестизначне число потрібно вивести повідомлення про помилку.");
//        Task4.run();
//        System.out.println();

//        System.out.println("Користувач вводить з клавіатури номер місяця(1-12). В залежності від отриманого номера програма виводить на екран надпис : Winter (якщо введене значення 1,2 або 12), Spring (якщо введене значення від 3 до 5), Summer (якщо введене значення від 6 до 8), Autumn (якщо введене значення від 9 до 11).\n" +
//                "Якщо користувач ввів значення не в діапазоні від 1 до 12 потрібно вивести повідомлення про помилку.");
//        Task5.run();
//        System.out.println();

//        System.out.println("Користувач вводить з клавіатури кількість метрів. В залежності від вибору користувача програма переводить метри в милі, дюйми чи ярди");
//        Task6.run();
//        System.out.println();

//        System.out.println("Користувач вводить з клавіатури два числа. Потрібно вивести всі непарні числа в вказаному діапазоні. Якщо границі вказані не вірно потрібно провести нормалізацію границь. Наприклад, якщо ввели 20 і 11, потрібна нормалізація, після якої початок стане рівним 11, а кінець 20.");
//        Task7.run();
//        System.out.println();

//        System.out.println("В одномірному масиві, заповненому випадковими числами, визначаємо мінімальне і максимальне значення, підраховуємо кількість від’ємних значень, підраховуємо кількість додатних значень, підраховуємо кількість нулів. Результат виводимо на екран.");
//        Task9.run();
//        System.out.println();

//        System.out.println("Написати метод, що відображає вертикальну або горизонтальну лінію із деяких символів. Метод приймає в якості параметрів: довжину лінії, напрям, символ.");
//        Task11.run();
//        System.out.println();

        System.out.println("Написати метод, що відображає вертикальну або горизонтальну лінію із деяких символів. Метод приймає в якості параметрів: довжину лінії, напрям, символ.");
        Task12.run();
        System.out.println();







    }






}
